Revit 2024 API
SchemaBuilder Constructor
 Constructs a new SchemaBuilder where the resulting Schema will use the input GUID.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public SchemaBuilder(
	Guid guid
)
Visual Basic
Public Sub New ( _
	guid As Guid _
)
Visual C++
public:
SchemaBuilder(
	Guid guid
)
Parameters
guid
Type: System.Guid
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The guid value is invalid.
See Also
SchemaBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace